Revit 2024 API
ScheduleSortGroupField Members
The ScheduleSortGroupField type exposes the following members.
Constructors
Name | Description
ScheduleSortGroupField()
 Creates a new ScheduleSortGroupField.
ScheduleSortGroupField(ScheduleFieldId)
 Creates a new ScheduleSortGroupField.
ScheduleSortGroupField(ScheduleFieldId, ScheduleSortOrder)
 Creates a new ScheduleSortGroupField.
Methods
Name | Description
Dispose
Releases all resources used by the ScheduleSortGroupField
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
FieldId
 The ID of the field that the schedule will be sorted or grouped by.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
ShowBlankLine
 Indicates if an empty row should be displayed between groups.
ShowFooter
 Indicates if a footer row should be displayed after each group.
ShowFooterCount
 Indicates if the footer row should display a count of elements in the group.
ShowFooterTitle
 Indicates if the footer row should display a title.
ShowHeader
 Indicates if a header row should be displayed before each group.
SortOrder
 Indicates if elements in the schedule will be sorted in ascending or descending order.
See Also
ScheduleSortGroupField Class
Autodesk.Revit.DB Namespace